GetProperty
Syntax
SapObject.SapModel.TendonObj.GetProperty
VB6 Procedure
Function GetProperty(ByVal Name As String, ByRef PropName As String) As Long
Parameters
Name
The name of a defined tendon object.
PropName
The name of the tendon property assigned to the tendon object.
Remarks
This function retrieves the tendon property assigned to a tendon object.
The function returns zero if the tendon object property is successfully retrieved, otherwise it returns a nonzero value.
VBA Example
Sub GetTendonProp()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim PropName As String
 Dim Name As String
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add tendon object by points
 ret = SapModel.TendonObj.AddByPoint("3", "9", Name)
 'get tendon section property
 ret = SapModel.TendonObj.GetProperty(Name, PropName)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.00.
See Also
SetProperty